src/cf/InformationRegisters/ор_РеестрЦенПроизводителейНаЖНВЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ор_РеестрЦенПроизводителейНаЖНВЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ор_Производители</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормаВыпускаПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВУпаковке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОптоваяНаценка</Name>
					<Comment>Оптовая наценка (не используется)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РозничнаяНаценка</Name>
					<Comment>Розничная наценка (не используется)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерВыписки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Это1СНоменклатура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаименованиеПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаВыпускаКраткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдРЛС</Name>
					<Comment>ID РЛС</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРегистрацииЦены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ор_РеестрЦенПроизводителейНаЖНВЛП/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область Переменные

&НаКлиенте
Перем ПредыдущаяНоменклатура; // Хранит значение номенклатуры, до ее изменения.

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Процедура - обработчик события "ПередЗаписьюНаСервере" формы.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Номенклатура) И НЕ ТекущийОбъект.Номенклатура.ор_ЖНВЛС Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Выбранная номенклатура не является ЖНВЛП'"),,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события "ПриИзменении" поля "Номенклатура".
//
&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	// Номенклатура очищена
	Если НЕ ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		Запись.Производитель = ПредопределенноеЗначение("Справочник.ор_Производители.ПустаяСсылка");
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.Номенклатура) И НЕ ПолучитьФлагЖНВЛС(Запись.Номенклатура) Тогда
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru= 'Номенклатура: %1 не является ЖНВЛП. Установить для нее признак ЖНВЛП?
				|В противном случае номенклатура будет очищена.'"),
			Запись.Номенклатура);
		ПоказатьВопрос(
			Новый ОписаниеОповещения("УстановкаПризнакаЖНВЛПВопросЗавершение", ЭтотОбъект),
			ТекстВопроса,
			РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	НоменклатураПриИзмененииПродолжение();
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля "Номенклатура".
//
&НаКлиенте
Процедура НоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПредыдущаяНоменклатура = Запись.Номенклатура;
КонецПроцедуры

// Процедура - обработчик события "Очистка" поля "Номенклатура".
//
&НаКлиенте
Процедура НоменклатураОчистка(Элемент, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.Штрихкод)
		И ПолучитьВыборкуШтрихкодов(Запись.Номенклатура, Запись.Штрихкод, Истина) Тогда
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru= 'Для номенклатуры %1 удалить штрихкод %2?'"),
			Запись.Номенклатура,
			Запись.Штрихкод);
		ПоказатьВопрос(
			Новый ОписаниеОповещения("УдалитьШтрихкодВопросЗавершение", ЭтотОбъект),
			ТекстВопроса,
			РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	НоменклатураОчисткаЗавершение();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановкаПризнакаЖНВЛПВопросЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		УстановитьФлагЖНВЛС();
	Иначе
		Запись.Номенклатура  = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
		Запись.Производитель = ПредопределенноеЗначение("Справочник.ор_Производители.ПустаяСсылка");
		Возврат;
	КонецЕсли;
	
	НоменклатураПриИзмененииПродолжение();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзмененииПродолжение()
	
	Если ЗначениеЗаполнено(Запись.Номенклатура) И НЕ ПолучитьФлагМониторингЦен(Запись.Номенклатура) Тогда
		УстановитьФлагМониторингЦен();
	КонецЕсли;
	
	// Проверим штрихкод
	Если ЗначениеЗаполнено(Запись.Штрихкод) Тогда
		
		Если ЗначениеЗаполнено(ПредыдущаяНоменклатура) И НЕ ПредыдущаяНоменклатура = Запись.Номенклатура Тогда
			УдалитьШтрихкод(ПредыдущаяНоменклатура, Запись.Штрихкод);
			ПредыдущаяНоменклатура = Неопределено;
		КонецЕсли;
		
		Если НЕ ПолучитьВыборкуШтрихкодов(Запись.Номенклатура, Запись.Штрихкод, Истина) Тогда
			ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru= 'Для номенклатуры %1 не задан штрихкод %2. Назначить указанный штрихкод?'"),
				Запись.Номенклатура,
				Запись.Штрихкод);
			ПоказатьВопрос(
				Новый ОписаниеОповещения("УстановкаШтрихкодаВопросЗавершение", ЭтотОбъект),
				ТекстВопроса,
				РежимДиалогаВопрос.ДаНет);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	НоменклатураПриИзмененииЗавершение();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаШтрихкодаВопросЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		СоздатьНовыйШтрихкод();
	КонецЕсли;
	
	НоменклатураПриИзмененииЗавершение();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзмененииЗавершение()
	
	// Попробуем подставить производителя
	Если ЗначениеЗаполнено(Запись.Номенклатура) И НЕ ПустаяСтрока(Запись.НаименованиеПроизводителя) Тогда
		УстановитьПроизводителя();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьШтрихкодВопросЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		УдалитьШтрихкод(Запись.Номенклатура, Запись.Штрихкод);
	КонецЕсли;
	
	НоменклатураОчисткаЗавершение();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураОчисткаЗавершение()
	
	Запись.Номенклатура  = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	Запись.Производитель = ПредопределенноеЗначение("Справочник.ор_Производители.ПустаяСсылка");
	
КонецПроцедуры

// Процедура получения флаг ЖНВЛП
//
&НаСервере
Функция ПолучитьФлагЖНВЛС(Номенклатура)
	Возврат Номенклатура.ор_ЖНВЛС;
КонецФункции

// Процедура получения флаг Зарегистрирован в системе мониторинга цен
//
&НаСервере
Функция ПолучитьФлагМониторингЦен(Номенклатура)
	Возврат Номенклатура.ор_ЗарегистрированВСистемеМониторингаЦен;
КонецФункции

// Процедура удаления штрихкода
//
&НаСервере
Процедура УдалитьШтрихкод(Номенклатура, Штрихкод)
	
	РезультатЗапроса = ПолучитьВыборкуШтрихкодов(Номенклатура, Штрихкод);
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяЗапись = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		НоваяЗапись.Удалить();
	КонецЦикла;
	
КонецПроцедуры

// Процедура создания штрихкода
//
Процедура СоздатьНовыйШтрихкод()
	
	НоваяЗапись = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
	НоваяЗапись.Номенклатура = Запись.Номенклатура;
	НоваяЗапись.Штрихкод     = Запись.Штрихкод;
	НоваяЗапись.Записать(Ложь);
	
КонецПроцедуры

// Процедура получения выборки штрихкодов
//
&НаСервере
Функция ПолучитьВыборкуШтрихкодов(Номенклатура, Штрихкод, ВернутьПризнакНеПустойВыборки=Ложь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.Номенклатура = &Номенклатура
	|	И ШтрихКоды.Штрихкод = &Штрихкод";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если ВернутьПризнакНеПустойВыборки Тогда
		Возврат (НЕ РезультатЗапроса.Пустой());
	Иначе
		Возврат РезультатЗапроса;
	КонецЕсли;
	
КонецФункции

// Процедура установки флага ЖНВЛП
//
&НаСервере
Процедура УстановитьФлагЖНВЛС()
	
	Попытка
		НоменклатураОбъект = Запись.Номенклатура.ПолучитьОбъект();
		НоменклатураОбъект.ор_ЖНВЛС = Истина;
		НоменклатураОбъект.Записать();
		Запись.Номенклатура = НоменклатураОбъект.Ссылка;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

// Процедура установки флага Зарегистрирован в системе мониторинга цен
//
&НаСервере
Процедура УстановитьФлагМониторингЦен()
	
	Попытка
		НоменклатураОбъект = Запись.Номенклатура.ПолучитьОбъект();
		НоменклатураОбъект.ор_ЗарегистрированВСистемеМониторингаЦен = Истина;
		НоменклатураОбъект.Записать();
		Запись.Номенклатура = НоменклатураОбъект.Ссылка;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

// Процедура установки производителя
//
&НаСервере
Процедура УстановитьПроизводителя()
	
	Если ЗначениеЗаполнено(Запись.Номенклатура.ор_Производитель) Тогда
		Если Запись.Номенклатура.ор_Производитель.Наименование = СокрЛП(Запись.НаименованиеПроизводителя) Тогда
			Запись.Производитель = Запись.Номенклатура.ор_Производитель;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
